app/controllers/hommages_controller.rb

  def create
    @hommage = current_user.hommages.build(hommage_params)
    if @hommage.save
      if params[:images]
          params[:images].each do |i|
            @hommage.photos.create(image: i)
---
INSERT INTO `hommages` (`last_name`, `first_name`, `date_birth`, `date_death`, `burial_place`, `description`, `user_id`, `created_at`, `updated_at`, `slug`) VALUES ('Platon', 'Grec', '1950-05-08', '2020-04-13', 'Père lachaise', '<p>Philosophe grec ayant inventé beaucoup de choses</p>\r\n', 2, '2020-04-13 12:48:14', '2020-04-13 12:48:14', 'hommage-platon-grec-2020-04-13-14-48-14-0200')
INSERT INTO `photos` (`hommage_id`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES (2, '2020-04-13 12:48:14', '2020-04-13 12:48:14', 'platon.jpeg', 'image/jpeg', 8817, '2020-04-13 12:48:14')

  def update
    if @hommage.update(hommage_params)
---
UPDATE `hommages` SET `first_name` = 'Lebrunnet', `updated_at` = '2020-05-11 11:55:24' WHERE `hommages`.`id` = 4

  def set_hommage
    @hommage = Hommage.find(params[:id])
---
SELECT  `hommages`.* FROM `hommages` WHERE `hommages`.`id` = 2 LIMIT 1