app/controllers/messages_controller.rb

INSERT INTO `messages` (`object`, `content`, `status`, `user_id`, `created_at`, `updated_at`, `slug`) VALUES ('test message apres la mort', '<p>testesttest</p>\r\n', 'not_send', 1, '2020-04-24 16:41:41', '2020-04-24 16:41:41', 'message-test-message-apres-la-mort-2020-04-24-18-41-41-0200')
---
  def create
    @message = current_user.messages.build(message_params)
    @message.status = 'not_send'
    if @message.save

SELECT `recipients_messages`.* FROM `recipients_messages` WHERE `recipients_messages`.`message_id` = 1
DELETE FROM `messages` WHERE `messages`.`id` = 1
DELETE FROM `recipients_messages` WHERE `recipients_messages`.`id` = 1
---
  def destroy
    @message = Message.friendly.find(params[:id])

    @recipients_messages = RecipientsMessage.where(message_id: @message.id)
    @recipients_messages.each do |i|
      i.destroy
    end
    @message.destroy

SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1
---
  def set_message
    @message = Message.friendly.find(params[:id])