app/controllers/pages_controller.rb

SELECT  `hommages`.* FROM `hommages` ORDER BY id DESC LIMIT 4 OFFSET 36
---
  def home
      @hommages = Hommage.limit(4).order('id DESC')