app/controllers/subscribers_controller.rb

UPDATE `users` SET `subscribed` = 1, `stripeid` = 'cus_H8gkIdFYHa9g5L', `updated_at` = '2020-04-21 16:54:28' WHERE `users`.`id` = 1
---
  def update
    token = params[:stripeToken]

    customer = Stripe::Customer.create(
        card: token,
        plan: "price_1Grh5OG6VjaT54O4p1EgxfK3",
        email: current_user.email
    )
    current_user.subscribed = true
    current_user.stripeid = customer.id
    current_user.save