app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @user = User.find(params[:id])